Rhino.Inside.Revit API
Revit.ActiveDBDocument Property
 Gets the active Autodesk.Revit.DB.Document in the Revit UI.
 Namespace: RhinoInside.Revit
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.7.8130
Syntax
public static Autodesk.Revit.DB.Document ActiveDBDocument { get; }
@property
def ActiveDBDocument(self) -> Autodesk.Revit.DB.Document
Property Value
Type: Autodesk.Revit.DB.Document
See Also
Reference
Revit Class
RhinoInside.Revit Namespace